Revit 2027 API
Concrete.ConcreteBrightmode Property
 The property labeled "Weathering" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string ConcreteBrightmode { get; }
Public Shared ReadOnly Property ConcreteBrightmode As String
	Get
public:
static property String^ ConcreteBrightmode {
	String^ get ();
}
static member ConcreteBrightmode : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteBrightmodeType".
See Also
Reference
Concrete Class
Autodesk.Revit.DB.Visual Namespace